reference/request_map.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Request Map</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-10 12:19:18 EST"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet Request Map"/>
<meta name="keywords" content="pallet request map"/>
<link rel="stylesheet" type="text/css" href="../doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Request Map</h1>

<p>The request map is used to accumulate the configuration data, and the results of
execution.
</p>
<p>
The request map has some well defined keys:
</p>
<ul>
<li>
:node-type : The pallet defnode type for the current node
</li>
<li>
:target-id : The id for the current node
</li>
<li>
:target-node : The jclouds node object for the current node
</li>
<li>
:all-nodes : The jclouds node objects for all nodes in the provider
</li>
<li>
:target-nodes : The jclouds node objects for all nodes in the current operation target
</li>
<li>
:parameters : The parameters used for cross-crate configuration
</li>
<li>
:results : the result of executing a converge or lift
</li>
<li>
:compute : The compute service
</li>
<li>
:compute-service : A map of :provider, :identity, :credential, and optionally
:extensions for constructing a jclouds compute service
</li>
<li>
:blobstore : The blobstore service
</li>
<li>
:user : The admin user to use on the nodes
</li>
<li>
:invocations : the invocation list of resources to run on each node
</li>
<li>
:cmds : merged invocation functions
</li>
</ul>

<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-01-10 12:19:18 EST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
